; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l6-t1-p7---int100n150-m25---int100c110---s114---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 l5 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 level85 - fuellevel
)

(:init
(sum level0 level5 level5)
(sum level0 level6 level6)
(sum level0 level9 level9)
(sum level0 level12 level12)
(sum level0 level13 level13)
(sum level0 level15 level15)
(sum level0 level18 level18)
(sum level0 level22 level22)
(sum level1 level5 level6)
(sum level1 level6 level7)
(sum level1 level9 level10)
(sum level1 level12 level13)
(sum level1 level13 level14)
(sum level1 level15 level16)
(sum level1 level18 level19)
(sum level1 level22 level23)
(sum level2 level5 level7)
(sum level2 level6 level8)
(sum level2 level9 level11)
(sum level2 level12 level14)
(sum level2 level13 level15)
(sum level2 level15 level17)
(sum level2 level18 level20)
(sum level2 level22 level24)
(sum level3 level5 level8)
(sum level3 level6 level9)
(sum level3 level9 level12)
(sum level3 level12 level15)
(sum level3 level13 level16)
(sum level3 level15 level18)
(sum level3 level18 level21)
(sum level3 level22 level25)
(sum level4 level5 level9)
(sum level4 level6 level10)
(sum level4 level9 level13)
(sum level4 level12 level16)
(sum level4 level13 level17)
(sum level4 level15 level19)
(sum level4 level18 level22)
(sum level4 level22 level26)
(sum level5 level5 level10)
(sum level5 level6 level11)
(sum level5 level9 level14)
(sum level5 level12 level17)
(sum level5 level13 level18)
(sum level5 level15 level20)
(sum level5 level18 level23)
(sum level5 level22 level27)
(sum level6 level5 level11)
(sum level6 level6 level12)
(sum level6 level9 level15)
(sum level6 level12 level18)
(sum level6 level13 level19)
(sum level6 level15 level21)
(sum level6 level18 level24)
(sum level6 level22 level28)
(sum level7 level5 level12)
(sum level7 level6 level13)
(sum level7 level9 level16)
(sum level7 level12 level19)
(sum level7 level13 level20)
(sum level7 level15 level22)
(sum level7 level18 level25)
(sum level7 level22 level29)
(sum level8 level5 level13)
(sum level8 level6 level14)
(sum level8 level9 level17)
(sum level8 level12 level20)
(sum level8 level13 level21)
(sum level8 level15 level23)
(sum level8 level18 level26)
(sum level8 level22 level30)
(sum level9 level5 level14)
(sum level9 level6 level15)
(sum level9 level9 level18)
(sum level9 level12 level21)
(sum level9 level13 level22)
(sum level9 level15 level24)
(sum level9 level18 level27)
(sum level9 level22 level31)
(sum level10 level5 level15)
(sum level10 level6 level16)
(sum level10 level9 level19)
(sum level10 level12 level22)
(sum level10 level13 level23)
(sum level10 level15 level25)
(sum level10 level18 level28)
(sum level10 level22 level32)
(sum level11 level5 level16)
(sum level11 level6 level17)
(sum level11 level9 level20)
(sum level11 level12 level23)
(sum level11 level13 level24)
(sum level11 level15 level26)
(sum level11 level18 level29)
(sum level11 level22 level33)
(sum level12 level5 level17)
(sum level12 level6 level18)
(sum level12 level9 level21)
(sum level12 level12 level24)
(sum level12 level13 level25)
(sum level12 level15 level27)
(sum level12 level18 level30)
(sum level12 level22 level34)
(sum level13 level5 level18)
(sum level13 level6 level19)
(sum level13 level9 level22)
(sum level13 level12 level25)
(sum level13 level13 level26)
(sum level13 level15 level28)
(sum level13 level18 level31)
(sum level13 level22 level35)
(sum level14 level5 level19)
(sum level14 level6 level20)
(sum level14 level9 level23)
(sum level14 level12 level26)
(sum level14 level13 level27)
(sum level14 level15 level29)
(sum level14 level18 level32)
(sum level14 level22 level36)
(sum level15 level5 level20)
(sum level15 level6 level21)
(sum level15 level9 level24)
(sum level15 level12 level27)
(sum level15 level13 level28)
(sum level15 level15 level30)
(sum level15 level18 level33)
(sum level15 level22 level37)
(sum level16 level5 level21)
(sum level16 level6 level22)
(sum level16 level9 level25)
(sum level16 level12 level28)
(sum level16 level13 level29)
(sum level16 level15 level31)
(sum level16 level18 level34)
(sum level16 level22 level38)
(sum level17 level5 level22)
(sum level17 level6 level23)
(sum level17 level9 level26)
(sum level17 level12 level29)
(sum level17 level13 level30)
(sum level17 level15 level32)
(sum level17 level18 level35)
(sum level17 level22 level39)
(sum level18 level5 level23)
(sum level18 level6 level24)
(sum level18 level9 level27)
(sum level18 level12 level30)
(sum level18 level13 level31)
(sum level18 level15 level33)
(sum level18 level18 level36)
(sum level18 level22 level40)
(sum level19 level5 level24)
(sum level19 level6 level25)
(sum level19 level9 level28)
(sum level19 level12 level31)
(sum level19 level13 level32)
(sum level19 level15 level34)
(sum level19 level18 level37)
(sum level19 level22 level41)
(sum level20 level5 level25)
(sum level20 level6 level26)
(sum level20 level9 level29)
(sum level20 level12 level32)
(sum level20 level13 level33)
(sum level20 level15 level35)
(sum level20 level18 level38)
(sum level20 level22 level42)
(sum level21 level5 level26)
(sum level21 level6 level27)
(sum level21 level9 level30)
(sum level21 level12 level33)
(sum level21 level13 level34)
(sum level21 level15 level36)
(sum level21 level18 level39)
(sum level21 level22 level43)
(sum level22 level5 level27)
(sum level22 level6 level28)
(sum level22 level9 level31)
(sum level22 level12 level34)
(sum level22 level13 level35)
(sum level22 level15 level37)
(sum level22 level18 level40)
(sum level22 level22 level44)
(sum level23 level5 level28)
(sum level23 level6 level29)
(sum level23 level9 level32)
(sum level23 level12 level35)
(sum level23 level13 level36)
(sum level23 level15 level38)
(sum level23 level18 level41)
(sum level23 level22 level45)
(sum level24 level5 level29)
(sum level24 level6 level30)
(sum level24 level9 level33)
(sum level24 level12 level36)
(sum level24 level13 level37)
(sum level24 level15 level39)
(sum level24 level18 level42)
(sum level24 level22 level46)
(sum level25 level5 level30)
(sum level25 level6 level31)
(sum level25 level9 level34)
(sum level25 level12 level37)
(sum level25 level13 level38)
(sum level25 level15 level40)
(sum level25 level18 level43)
(sum level25 level22 level47)
(sum level26 level5 level31)
(sum level26 level6 level32)
(sum level26 level9 level35)
(sum level26 level12 level38)
(sum level26 level13 level39)
(sum level26 level15 level41)
(sum level26 level18 level44)
(sum level26 level22 level48)
(sum level27 level5 level32)
(sum level27 level6 level33)
(sum level27 level9 level36)
(sum level27 level12 level39)
(sum level27 level13 level40)
(sum level27 level15 level42)
(sum level27 level18 level45)
(sum level27 level22 level49)
(sum level28 level5 level33)
(sum level28 level6 level34)
(sum level28 level9 level37)
(sum level28 level12 level40)
(sum level28 level13 level41)
(sum level28 level15 level43)
(sum level28 level18 level46)
(sum level28 level22 level50)
(sum level29 level5 level34)
(sum level29 level6 level35)
(sum level29 level9 level38)
(sum level29 level12 level41)
(sum level29 level13 level42)
(sum level29 level15 level44)
(sum level29 level18 level47)
(sum level29 level22 level51)
(sum level30 level5 level35)
(sum level30 level6 level36)
(sum level30 level9 level39)
(sum level30 level12 level42)
(sum level30 level13 level43)
(sum level30 level15 level45)
(sum level30 level18 level48)
(sum level30 level22 level52)
(sum level31 level5 level36)
(sum level31 level6 level37)
(sum level31 level9 level40)
(sum level31 level12 level43)
(sum level31 level13 level44)
(sum level31 level15 level46)
(sum level31 level18 level49)
(sum level31 level22 level53)
(sum level32 level5 level37)
(sum level32 level6 level38)
(sum level32 level9 level41)
(sum level32 level12 level44)
(sum level32 level13 level45)
(sum level32 level15 level47)
(sum level32 level18 level50)
(sum level32 level22 level54)
(sum level33 level5 level38)
(sum level33 level6 level39)
(sum level33 level9 level42)
(sum level33 level12 level45)
(sum level33 level13 level46)
(sum level33 level15 level48)
(sum level33 level18 level51)
(sum level33 level22 level55)
(sum level34 level5 level39)
(sum level34 level6 level40)
(sum level34 level9 level43)
(sum level34 level12 level46)
(sum level34 level13 level47)
(sum level34 level15 level49)
(sum level34 level18 level52)
(sum level34 level22 level56)
(sum level35 level5 level40)
(sum level35 level6 level41)
(sum level35 level9 level44)
(sum level35 level12 level47)
(sum level35 level13 level48)
(sum level35 level15 level50)
(sum level35 level18 level53)
(sum level35 level22 level57)
(sum level36 level5 level41)
(sum level36 level6 level42)
(sum level36 level9 level45)
(sum level36 level12 level48)
(sum level36 level13 level49)
(sum level36 level15 level51)
(sum level36 level18 level54)
(sum level36 level22 level58)
(sum level37 level5 level42)
(sum level37 level6 level43)
(sum level37 level9 level46)
(sum level37 level12 level49)
(sum level37 level13 level50)
(sum level37 level15 level52)
(sum level37 level18 level55)
(sum level37 level22 level59)
(sum level38 level5 level43)
(sum level38 level6 level44)
(sum level38 level9 level47)
(sum level38 level12 level50)
(sum level38 level13 level51)
(sum level38 level15 level53)
(sum level38 level18 level56)
(sum level38 level22 level60)
(sum level39 level5 level44)
(sum level39 level6 level45)
(sum level39 level9 level48)
(sum level39 level12 level51)
(sum level39 level13 level52)
(sum level39 level15 level54)
(sum level39 level18 level57)
(sum level39 level22 level61)
(sum level40 level5 level45)
(sum level40 level6 level46)
(sum level40 level9 level49)
(sum level40 level12 level52)
(sum level40 level13 level53)
(sum level40 level15 level55)
(sum level40 level18 level58)
(sum level40 level22 level62)
(sum level41 level5 level46)
(sum level41 level6 level47)
(sum level41 level9 level50)
(sum level41 level12 level53)
(sum level41 level13 level54)
(sum level41 level15 level56)
(sum level41 level18 level59)
(sum level41 level22 level63)
(sum level42 level5 level47)
(sum level42 level6 level48)
(sum level42 level9 level51)
(sum level42 level12 level54)
(sum level42 level13 level55)
(sum level42 level15 level57)
(sum level42 level18 level60)
(sum level42 level22 level64)
(sum level43 level5 level48)
(sum level43 level6 level49)
(sum level43 level9 level52)
(sum level43 level12 level55)
(sum level43 level13 level56)
(sum level43 level15 level58)
(sum level43 level18 level61)
(sum level43 level22 level65)
(sum level44 level5 level49)
(sum level44 level6 level50)
(sum level44 level9 level53)
(sum level44 level12 level56)
(sum level44 level13 level57)
(sum level44 level15 level59)
(sum level44 level18 level62)
(sum level44 level22 level66)
(sum level45 level5 level50)
(sum level45 level6 level51)
(sum level45 level9 level54)
(sum level45 level12 level57)
(sum level45 level13 level58)
(sum level45 level15 level60)
(sum level45 level18 level63)
(sum level45 level22 level67)
(sum level46 level5 level51)
(sum level46 level6 level52)
(sum level46 level9 level55)
(sum level46 level12 level58)
(sum level46 level13 level59)
(sum level46 level15 level61)
(sum level46 level18 level64)
(sum level46 level22 level68)
(sum level47 level5 level52)
(sum level47 level6 level53)
(sum level47 level9 level56)
(sum level47 level12 level59)
(sum level47 level13 level60)
(sum level47 level15 level62)
(sum level47 level18 level65)
(sum level47 level22 level69)
(sum level48 level5 level53)
(sum level48 level6 level54)
(sum level48 level9 level57)
(sum level48 level12 level60)
(sum level48 level13 level61)
(sum level48 level15 level63)
(sum level48 level18 level66)
(sum level48 level22 level70)
(sum level49 level5 level54)
(sum level49 level6 level55)
(sum level49 level9 level58)
(sum level49 level12 level61)
(sum level49 level13 level62)
(sum level49 level15 level64)
(sum level49 level18 level67)
(sum level49 level22 level71)
(sum level50 level5 level55)
(sum level50 level6 level56)
(sum level50 level9 level59)
(sum level50 level12 level62)
(sum level50 level13 level63)
(sum level50 level15 level65)
(sum level50 level18 level68)
(sum level50 level22 level72)
(sum level51 level5 level56)
(sum level51 level6 level57)
(sum level51 level9 level60)
(sum level51 level12 level63)
(sum level51 level13 level64)
(sum level51 level15 level66)
(sum level51 level18 level69)
(sum level51 level22 level73)
(sum level52 level5 level57)
(sum level52 level6 level58)
(sum level52 level9 level61)
(sum level52 level12 level64)
(sum level52 level13 level65)
(sum level52 level15 level67)
(sum level52 level18 level70)
(sum level52 level22 level74)
(sum level53 level5 level58)
(sum level53 level6 level59)
(sum level53 level9 level62)
(sum level53 level12 level65)
(sum level53 level13 level66)
(sum level53 level15 level68)
(sum level53 level18 level71)
(sum level53 level22 level75)
(sum level54 level5 level59)
(sum level54 level6 level60)
(sum level54 level9 level63)
(sum level54 level12 level66)
(sum level54 level13 level67)
(sum level54 level15 level69)
(sum level54 level18 level72)
(sum level54 level22 level76)
(sum level55 level5 level60)
(sum level55 level6 level61)
(sum level55 level9 level64)
(sum level55 level12 level67)
(sum level55 level13 level68)
(sum level55 level15 level70)
(sum level55 level18 level73)
(sum level55 level22 level77)
(sum level56 level5 level61)
(sum level56 level6 level62)
(sum level56 level9 level65)
(sum level56 level12 level68)
(sum level56 level13 level69)
(sum level56 level15 level71)
(sum level56 level18 level74)
(sum level56 level22 level78)
(sum level57 level5 level62)
(sum level57 level6 level63)
(sum level57 level9 level66)
(sum level57 level12 level69)
(sum level57 level13 level70)
(sum level57 level15 level72)
(sum level57 level18 level75)
(sum level57 level22 level79)
(sum level58 level5 level63)
(sum level58 level6 level64)
(sum level58 level9 level67)
(sum level58 level12 level70)
(sum level58 level13 level71)
(sum level58 level15 level73)
(sum level58 level18 level76)
(sum level58 level22 level80)
(sum level59 level5 level64)
(sum level59 level6 level65)
(sum level59 level9 level68)
(sum level59 level12 level71)
(sum level59 level13 level72)
(sum level59 level15 level74)
(sum level59 level18 level77)
(sum level59 level22 level81)
(sum level60 level5 level65)
(sum level60 level6 level66)
(sum level60 level9 level69)
(sum level60 level12 level72)
(sum level60 level13 level73)
(sum level60 level15 level75)
(sum level60 level18 level78)
(sum level60 level22 level82)
(sum level61 level5 level66)
(sum level61 level6 level67)
(sum level61 level9 level70)
(sum level61 level12 level73)
(sum level61 level13 level74)
(sum level61 level15 level76)
(sum level61 level18 level79)
(sum level61 level22 level83)
(sum level62 level5 level67)
(sum level62 level6 level68)
(sum level62 level9 level71)
(sum level62 level12 level74)
(sum level62 level13 level75)
(sum level62 level15 level77)
(sum level62 level18 level80)
(sum level62 level22 level84)
(sum level63 level5 level68)
(sum level63 level6 level69)
(sum level63 level9 level72)
(sum level63 level12 level75)
(sum level63 level13 level76)
(sum level63 level15 level78)
(sum level63 level18 level81)
(sum level63 level22 level85)
(sum level64 level5 level69)
(sum level64 level6 level70)
(sum level64 level9 level73)
(sum level64 level12 level76)
(sum level64 level13 level77)
(sum level64 level15 level79)
(sum level64 level18 level82)
(sum level65 level5 level70)
(sum level65 level6 level71)
(sum level65 level9 level74)
(sum level65 level12 level77)
(sum level65 level13 level78)
(sum level65 level15 level80)
(sum level65 level18 level83)
(sum level66 level5 level71)
(sum level66 level6 level72)
(sum level66 level9 level75)
(sum level66 level12 level78)
(sum level66 level13 level79)
(sum level66 level15 level81)
(sum level66 level18 level84)
(sum level67 level5 level72)
(sum level67 level6 level73)
(sum level67 level9 level76)
(sum level67 level12 level79)
(sum level67 level13 level80)
(sum level67 level15 level82)
(sum level67 level18 level85)
(sum level68 level5 level73)
(sum level68 level6 level74)
(sum level68 level9 level77)
(sum level68 level12 level80)
(sum level68 level13 level81)
(sum level68 level15 level83)
(sum level69 level5 level74)
(sum level69 level6 level75)
(sum level69 level9 level78)
(sum level69 level12 level81)
(sum level69 level13 level82)
(sum level69 level15 level84)
(sum level70 level5 level75)
(sum level70 level6 level76)
(sum level70 level9 level79)
(sum level70 level12 level82)
(sum level70 level13 level83)
(sum level70 level15 level85)
(sum level71 level5 level76)
(sum level71 level6 level77)
(sum level71 level9 level80)
(sum level71 level12 level83)
(sum level71 level13 level84)
(sum level72 level5 level77)
(sum level72 level6 level78)
(sum level72 level9 level81)
(sum level72 level12 level84)
(sum level72 level13 level85)
(sum level73 level5 level78)
(sum level73 level6 level79)
(sum level73 level9 level82)
(sum level73 level12 level85)
(sum level74 level5 level79)
(sum level74 level6 level80)
(sum level74 level9 level83)
(sum level75 level5 level80)
(sum level75 level6 level81)
(sum level75 level9 level84)
(sum level76 level5 level81)
(sum level76 level6 level82)
(sum level76 level9 level85)
(sum level77 level5 level82)
(sum level77 level6 level83)
(sum level78 level5 level83)
(sum level78 level6 level84)
(sum level79 level5 level84)
(sum level79 level6 level85)
(sum level80 level5 level85)

(connected l0 l2)
(fuelcost level15 l0 l2)
(connected l0 l4)
(fuelcost level9 l0 l4)
(connected l0 l5)
(fuelcost level22 l0 l5)
(connected l1 l2)
(fuelcost level5 l1 l2)
(connected l1 l5)
(fuelcost level15 l1 l5)
(connected l2 l0)
(fuelcost level15 l2 l0)
(connected l2 l1)
(fuelcost level5 l2 l1)
(connected l2 l4)
(fuelcost level18 l2 l4)
(connected l2 l5)
(fuelcost level12 l2 l5)
(connected l3 l4)
(fuelcost level6 l3 l4)
(connected l4 l0)
(fuelcost level9 l4 l0)
(connected l4 l2)
(fuelcost level18 l4 l2)
(connected l4 l3)
(fuelcost level6 l4 l3)
(connected l4 l5)
(fuelcost level13 l4 l5)
(connected l5 l0)
(fuelcost level22 l5 l0)
(connected l5 l1)
(fuelcost level15 l5 l1)
(connected l5 l2)
(fuelcost level12 l5 l2)
(connected l5 l4)
(fuelcost level13 l5 l4)

(at t0 l0)
(fuel t0 level85)
(= (total-cost) 0)

(at p0 l4)
(at p1 l4)
(at p2 l4)
(at p3 l5)
(at p4 l2)
(at p5 l1)
(at p6 l3)
)

(:goal
(and
(at p0 l2)
(at p1 l5)
(at p2 l1)
(at p3 l1)
(at p4 l4)
(at p5 l0)
(at p6 l5)
)
)
(:metric minimize (total-cost)))

; plan
1. (drive t0 l0 l4 level76 level9 level85)
   deleted: (at t0 l0) (fuel t0 level85)
   added: (at t0 l4) (fuel t0 level76)
   goals met: 0 of 7
2. (load p2 t0 l4)
   deleted: (at p2 l4)
   added: (in p2 t0)
   goals met: 0 of 7
3. (load p1 t0 l4)
   deleted: (at p1 l4)
   added: (in p1 t0)
   goals met: 0 of 7
4. (load p0 t0 l4)
   deleted: (at p0 l4)
   added: (in p0 t0)
   goals met: 0 of 7
5. (drive t0 l4 l3 level70 level6 level76)
   deleted: (at t0 l4) (fuel t0 level76)
   added: (at t0 l3) (fuel t0 level70)
   goals met: 0 of 7
6. (load p6 t0 l3)
   deleted: (at p6 l3)
   added: (in p6 t0)
   goals met: 0 of 7
7. (drive t0 l3 l4 level64 level6 level70)
   deleted: (at t0 l3) (fuel t0 level70)
   added: (at t0 l4) (fuel t0 level64)
   goals met: 0 of 7
8. (drive t0 l4 l5 level51 level13 level64)
   deleted: (at t0 l4) (fuel t0 level64)
   added: (at t0 l5) (fuel t0 level51)
   goals met: 0 of 7
9. (unload p6 t0 l5)
   deleted: (in p6 t0)
   added: (at p6 l5)
   goals met: 1 of 7
10. (unload p1 t0 l5)
   deleted: (in p1 t0)
   added: (at p1 l5)
   goals met: 2 of 7
11. (load p3 t0 l5)
   deleted: (at p3 l5)
   added: (in p3 t0)
   goals met: 2 of 7
12. (drive t0 l5 l1 level36 level15 level51)
   deleted: (at t0 l5) (fuel t0 level51)
   added: (at t0 l1) (fuel t0 level36)
   goals met: 2 of 7
13. (load p5 t0 l1)
   deleted: (at p5 l1)
   added: (in p5 t0)
   goals met: 2 of 7
14. (unload p2 t0 l1)
   deleted: (in p2 t0)
   added: (at p2 l1)
   goals met: 3 of 7
15. (unload p3 t0 l1)
   deleted: (in p3 t0)
   added: (at p3 l1)
   goals met: 4 of 7
16. (drive t0 l1 l2 level31 level5 level36)
   deleted: (at t0 l1) (fuel t0 level36)
   added: (at t0 l2) (fuel t0 level31)
   goals met: 4 of 7
17. (load p4 t0 l2)
   deleted: (at p4 l2)
   added: (in p4 t0)
   goals met: 4 of 7
18. (unload p0 t0 l2)
   deleted: (in p0 t0)
   added: (at p0 l2)
   goals met: 5 of 7
19. (drive t0 l2 l0 level16 level15 level31)
   deleted: (at t0 l2) (fuel t0 level31)
   added: (at t0 l0) (fuel t0 level16)
   goals met: 5 of 7
20. (unload p5 t0 l0)
   deleted: (in p5 t0)
   added: (at p5 l0)
   goals met: 6 of 7
21. (drive t0 l0 l4 level7 level9 level16)
   deleted: (at t0 l0) (fuel t0 level16)
   added: (at t0 l4) (fuel t0 level7)
   goals met: 6 of 7
22. (unload p4 t0 l4)
   deleted: (in p4 t0)
   added: (at p4 l4)
   goals met: 7 of 7
